EyeFi Protocol/GetPhotoStatus.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="EyeFi/SOAP/EyeFilm">
  <SOAP-ENV:Body>
    <ns1:GetPhotoStatus>
      <credential>5dde8a52554ff5aa9762d96c7b854194</credential>
      <macaddress>0018566016f7</macaddress>
      <filename>DSC_0010.JPG.tar</filename>
      <filesize>332800</filesize>
      <filesignature>344d342692839ddfcc26ca161c59b555</filesignature>
      <flags>4</flags>
    </ns1:GetPhotoStatus>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
